In [8]:
!pip install scikit-learn
!pip install seaborn
!pip install matplotlib

Requirement already satisfied: scikit-learn in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (1.5.0)
Requirement already satisfied: numpy>=1.19.5 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from scikit-learn) (1.26.4)
Requirement already satisfied: scipy>=1.6.0 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from scikit-learn) (1.13.1)
Requirement already satisfied: joblib>=1.2.0 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from scikit-learn) (3.5.0)
Requirement already satisfied: seaborn in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (1.26.4)
Requirement already satisfied: pandas>=1.2 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (2.2.2)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (3.9.0)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.2.1)
Requirement already satisfied: cycler>=0.10 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.53.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.5)
Requirement already satisfied: packaging>=20.0 in c:\users\maria\appdata\roaming\python\python312\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.0)
Requirement already satisfied: pillow>=8 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (10.3.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\maria\appdata\roaming\python\python312\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\maria\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.16.0)
Requirement already satisfied: matplotlib in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (3.9.0)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.2.1)
Requirement already satisfied: cycler>=0.10 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (4.53.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.4.5)
Requirement already satisfied: numpy>=1.23 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.26.4)
Requirement already satisfied: packaging>=20.0 in c:\users\maria\appdata\roaming\python\python312\site-packages (from matplotlib) (24.0)
Requirement already satisfied: pillow>=8 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (10.3.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\maria\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\maria\appdata\roaming\python\python312\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\maria\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)

In [9]:
# importamos las librerías que necesitamos

# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np
import re

# Imputación de nulos usando métodos avanzados estadísticos
# -----------------------------------------------------------------------
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer

# Librerías de visualización
# -----------------------------------------------------------------------
import seaborn as sns
import matplotlib.pyplot as plt
# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [10]:
# Punto --> Exploración de los datos! ✅

In [11]:
df = pd.read_csv('df_superlimpiooo.csv', index_col= 0)
df.head()

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,remotework
employeenumber,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
"162,0",51,No,NaN,684.0,6,3,NaN,1,Male,51,3,5,research director,3,NaN,195370.0,6462,7,No,13,3.0,3,0,NaN,5,3.0,20,15,15,19537.0,1972,Yes
"259,0",52,No,NaN,699.0,1,4,life sciences,3,Male,65,2,5,manager,3,NaN,199990.0,5678,0,NaN,14,3.0,1,1,34.0,5,3.0,33,11,9,19999.0,1971,Yes
"319,0",42,No,travel rarely,532.0,4,2,technical degree,3,Male,58,3,5,manager,4,married,192320.0,4933,1,No,11,3.0,4,0,22.0,3,NaN,22,11,15,19232.0,1981,Yes
NaN,47,No,travel rarely,359.0,2,4,medical,1,Female,82,3,4,research director,3,married,171690.0,26703,3,NaN,19,3.0,2,2,NaN,2,NaN,20,5,6,17169.0,1976,No
NaN,46,No,NaN,1319.0,3,3,technical degree,1,Female,45,4,4,sales executive,1,divorced,NaN,7739,2,No,12,3.0,4,1,NaN,5,3.0,19,2,8,NaN,1977,No

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1614 entries, 162,0 to nan
Data columns (total 32 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   businesstravel            842 non-null    object
 3   dailyrate                 1490 non-null   float64
 4   distancefromhome          1614 non-null   int64
 5   education                 1614 non-null   int64
 6   educationfield            869 non-null    object
 7   environmentsatisfaction   1614 non-null   int64
 8   gender                    1614 non-null   object
 9   hourlyrate                1614 non-null   int64
 10  jobinvolvement            1614 non-null   int64
 11  joblevel                  1614 non-null   int64
 12  jobrole                   1614 non-null   object
 13  jobsatisfaction           1614 non-null   int64
 14  maritalstatus             963 non-null    object
 15  monthlyincome             771 non-null    float64
 16  monthlyrate               1614 non-null   int64
 17  numcompaniesworked        1614 non-null   int64
 18  overtime                  938 non-null    object
 19  percentsalaryhike         1614 non-null   int64
 20  performancerating         1419 non-null   float64
 21  relationshipsatisfaction  1614 non-null   int64
 22  stockoptionlevel          1614 non-null   int64
 23  totalworkingyears         1088 non-null   float64
 24  trainingtimeslastyear     1614 non-null   int64
 25  worklifebalance           1506 non-null   float64
 26  yearsatcompany            1614 non-null   int64
 27  yearssincelastpromotion   1614 non-null   int64
 28  yearswithcurrmanager      1614 non-null   int64
 29  sameasmonthlyincome       771 non-null    float64
 30  datebirth                 1614 non-null   int64
 31  remotework                1614 non-null   object
dtypes: float64(6), int64(18), object(8)
memory usage: 416.1+ KB

In [13]:
df.dtypes

age                           int64
attrition                    object
businesstravel               object
dailyrate                   float64
distancefromhome              int64
education                     int64
educationfield               object
environmentsatisfaction       int64
gender                       object
hourlyrate                    int64
jobinvolvement                int64
joblevel                      int64
jobrole                      object
jobsatisfaction               int64
maritalstatus                object
monthlyincome               float64
monthlyrate                   int64
numcompaniesworked            int64
overtime                     object
percentsalaryhike             int64
performancerating           float64
relationshipsatisfaction      int64
stockoptionlevel              int64
totalworkingyears           float64
trainingtimeslastyear         int64
worklifebalance             float64
yearsatcompany                int64
yearssincelastpromotion       int64
yearswithcurrmanager          int64
sameasmonthlyincome         float64
datebirth                     int64
remotework                   object
dtype: object

In [15]:
# Obtenemos la lista de columnas categóricas que tienen nulos
nulos_esta_cat = df[df.columns[df.isnull().any()]].select_dtypes(include = "O").columns
print("Las columnas categóricas que tienen nulos son : \n ")
print(nulos_esta_cat)

Las columnas categóricas que tienen nulos son :

Index(['businesstravel', 'educationfield', 'maritalstatus', 'overtime'], dtype='object')

# A) Tratamiento de valores nulos Variables Categoricas

In [16]:
#funcion para calcular el porcentaje de valores nulos en las variables categoricas
def calcular_porcentaje_nulos(df, columnas_categoricas):
    porcentaje_nulos = {}
    for columna in columnas_categoricas:
        # Calcular el número de valores nulos
        nulos = df[columna].isnull().sum()
        # Calcular el porcentaje de valores nulos
        porcentaje = (nulos / len(df)) * 100
        # Guardar el resultado en el diccionario
        porcentaje_nulos[columna] = porcentaje
    return porcentaje_nulos

In [17]:
# Lista de columnas categóricas
columnas_categoricas = ['businesstravel', 'educationfield', 'maritalstatus', 'overtime']

In [18]:
porcentajes_nulos = calcular_porcentaje_nulos(df, columnas_categoricas)

for columna, porcentaje in porcentajes_nulos.items():
    print(f"{columna}: {porcentaje:.2f}%")

businesstravel: 47.83%
educationfield: 46.16%
maritalstatus: 40.33%
overtime: 41.88%

In [ ]:
#Según los porcentajes de las categorías, si hay una categoría dominante reemplazamos por la moda, de lo contrario indicamos que pertenece a la categoría 'unknown'(desconocido)

# educationfield :categoría 'Desconocido' porque tiene casi 47% de nulos.

# maritalstatus categoría 'Desconocido' porque tiene un 40% de nulos. 

#overtime: categoría 'Desconocido' porque tiene un 40% de nulos.

In [19]:
columnas_categoricas = ['businesstravel','educationfield', 'maritalstatus', 'overtime']

In [20]:
def reemplazar_nulos_por_moda(df, columnas_categoricas):
    for columna in columnas_categoricas:
        # Calcular la moda de la columna
        moda = df[columna].mode()[0]
        # Reemplazar los valores nulos por la moda
        df[columna] = df[columna].fillna(moda)
    return df

In [21]:
df = reemplazar_nulos_por_moda(df, columnas_categoricas)

In [22]:
print("\nDespués de reemplazar los nulos:")
print(df)

Después de reemplazar los nulos:
                age attrition businesstravel  dailyrate  distancefromhome  \
employeenumber
162,0            51        No  travel rarely      684.0                 6
259,0            52        No  travel rarely      699.0                 1
319,0            42        No  travel rarely      532.0                 4
NaN              47        No  travel rarely      359.0                 2
NaN              46        No  travel rarely     1319.0                 3
...             ...       ...            ...        ...               ...
967,0            36       Yes  travel rarely      530.0                 3
972,0            45        No     non travel      805.0                 4
NaN              39        No  travel rarely      903.0                13
990,0            36        No     non travel     1229.0                 8
NaN              46        No  travel rarely      566.0                 7

                education    educationfield  environmentsatisfaction  gender  \
employeenumber
162,0                   3     life sciences                        1    Male
259,0                   4     life sciences                        3    Male
319,0                   2  technical degree                        3    Male
NaN                     4           medical                        1  Female
NaN                     3  technical degree                        1  Female
...                   ...               ...                      ...     ...
967,0                   1     life sciences                        3    Male
972,0                   2     life sciences                        3    Male
NaN                     5     life sciences                       13    Male
990,0                   4  technical degree                        1    Male
NaN                     2           medical                        4    Male

                hourlyrate  jobinvolvement  joblevel  \
employeenumber
162,0                   51               3         5
259,0                   65               2         5
319,0                   58               3         5
NaN                     82               3         4
NaN                     45               4         4
...                    ...             ...       ...
967,0                   51               2         3
972,0                   57               3         2
NaN                     41               4         3
990,0                   84               3         2
NaN                     75               3         3

                                 jobrole  jobsatisfaction maritalstatus  \
employeenumber
162,0                 research director                 3       married
259,0                           manager                 3       married
319,0                           manager                 4       married
NaN                   research director                 3       married
NaN                     sales executive                 1      divorced
...                                  ...              ...           ...
967,0                   sales executive                 4       married
972,0             laboratory technician                 2       married
NaN                     sales executive                 3        single
990,0                   sales executive                 4      divorced
NaN              manufacturing director                 3       married

                monthlyincome  monthlyrate  numcompaniesworked overtime  \
employeenumber
162,0                195370.0         6462                   7       No
259,0                199990.0         5678                   0       No
319,0                192320.0         4933                   1       No
NaN                  171690.0        26703                   3       No
NaN                       NaN         7739                   2       No
...                       ...          ...                 ...      ...
967,0                103250.0         5518                   1       No
972,0                 44470.0        23163                   1       No
NaN                       NaN         2560                   0       No
990,0                     NaN        25952                   4       No
NaN                  108450.0        24208                   6       No

                percentsalaryhike  performancerating  \
employeenumber
162,0                          13                3.0
259,0                          14                3.0
319,0                          11                3.0
NaN                            19                3.0
NaN                            12                3.0
...                           ...                ...
967,0                          11                NaN
972,0                          12                3.0
NaN                            18                3.0
990,0                          13                NaN
NaN                            13                3.0

                relationshipsatisfaction  stockoptionlevel  totalworkingyears  \
employeenumber
162,0                                  3                 0                NaN
259,0                                  1                 1               34.0
319,0                                  4                 0               22.0
NaN                                    2                 2                NaN
NaN                                    4                 1                NaN
...                                  ...               ...                ...
967,0                                  1                 1                NaN
972,0                                  2                 0                NaN
NaN                                    4                 0                9.0
990,0                                  4                 2               12.0
NaN                                    2                 1                NaN

                trainingtimeslastyear  worklifebalance  yearsatcompany  \
employeenumber
162,0                               5              3.0              20
259,0                               5              3.0              33
319,0                               3              NaN              22
NaN                                 2              NaN              20
NaN                                 5              3.0              19
...                               ...              ...             ...
967,0                               6              3.0              16
972,0                               5              2.0               9
NaN                                 3              3.0               8
990,0                               3              3.0               7
NaN                                 3              3.0               8

                yearssincelastpromotion  yearswithcurrmanager  \
employeenumber
162,0                                15                    15
259,0                                11                     9
319,0                                11                    15
NaN                                   5                     6
NaN                                   2                     8
...                                 ...                   ...
967,0                                 3                     7
972,0                                 0                     8
NaN                                   0                     7
990,0                                 0                     7
NaN                                   0                     7

                sameasmonthlyincome  datebirth remotework
employeenumber
162,0                       19537.0       1972        Yes
259,0                       19999.0       1971        Yes
319,0                       19232.0       1981        Yes
NaN                         17169.0       1976         No
NaN                             NaN       1977         No
...                             ...        ...        ...
967,0                       10325.0       1987         No
972,0                        4447.0       1978        Yes
NaN                             NaN       1984        Yes
990,0                           NaN       1987        Yes
NaN                         10845.0       1977         No

[1614 rows x 32 columns]

In [23]:
# Obtenemos la lista de columnas categóricas que tienen nulos
nulos_esta_cat = df[df.columns[df.isnull().any()]].select_dtypes(include = "O").columns
print("Las columnas categóricas que tienen nulos son : \n ")
print(nulos_esta_cat)

Las columnas categóricas que tienen nulos son :

Index([], dtype='object')

In [24]:
df.head(5)

,age,attrition,businesstravel,dailyrate,distancefromhome,education,educationfield,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,remotework
employeenumber,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
"162,0",51,No,travel rarely,684.0,6,3,life sciences,1,Male,51,3,5,research director,3,married,195370.0,6462,7,No,13,3.0,3,0,NaN,5,3.0,20,15,15,19537.0,1972,Yes
"259,0",52,No,travel rarely,699.0,1,4,life sciences,3,Male,65,2,5,manager,3,married,199990.0,5678,0,No,14,3.0,1,1,34.0,5,3.0,33,11,9,19999.0,1971,Yes
"319,0",42,No,travel rarely,532.0,4,2,technical degree,3,Male,58,3,5,manager,4,married,192320.0,4933,1,No,11,3.0,4,0,22.0,3,NaN,22,11,15,19232.0,1981,Yes
NaN,47,No,travel rarely,359.0,2,4,medical,1,Female,82,3,4,research director,3,married,171690.0,26703,3,No,19,3.0,2,2,NaN,2,NaN,20,5,6,17169.0,1976,No
NaN,46,No,travel rarely,1319.0,3,3,technical degree,1,Female,45,4,4,sales executive,1,divorced,NaN,7739,2,No,12,3.0,4,1,NaN,5,3.0,19,2,8,NaN,1977,No